# age1 = int(input("возраст 1\n"))
# age2 = int(input("возраст 2\n"))
# age3 = int(input("возраст 3\n"))
# if age3 > age1 and age3>age2:
#     print("age3 больше age1 и age2")
# elif age2 > age1 and age2>age3:
#     print("age2 больше age1 и age3")
# else:
#     print("age1 больше всех")
# print("в магазине продаётся новая сумка за 2500 р. и мощный сноуборд за 5000 р. ты хочешь купить что-то")
# s = 2499
# sb = 4999
# sbs = s + sb - 1
# b = int(input("сколько у тебя денег?\n"))
# if b>sbs:
#     print("тебе хватает и на сумку, и на сноуборд однвременно")
# elif b>sb:
#     print("тебе хватает только на сумку")
# elif sb>b>s:
#     print("тебе хватает либо на сумку, либо на сноуборд")
# else:
#     print("тебе ни на чтo не хватает")
# print("есть 4 товара. хлеб за 50, молоко за 100, мармелад за 150 и сок за 200")
# d = int(input("сколько у тебя денег?\n"))
# h = 49
# m = 99
# mm = 149
# s = 199
# if d>s:
#     print("ты можещь купить любой товар из списка")
# elif s>d>mm:
#     print("ты можешь купить мармелад, молоко или хлеб")
# elif mm>d>m:
#     print("ты можешь купить молоко или хлеб")
# elif m>d>h:
#     print("ты можешь купить только хлеб")
# elif h>d:
#     print("ты ничего не можешь купить")

for i in range(1, 101):
    print(i)